{"Brand Name": "Twinrix Preservative-Free", "Side Effects": {"Common side effects": ["Get emergency medical help if you have any of these signs of an allergic reaction while taking hepatitis a adult vaccine / hepatitis b adult vaccine:  hives; difficulty breathing; swelling of your face, lips, tongue, or throat.", "Keep track of any and all side effects you have after receiving this vaccine.  When you receive a booster dose, you will need to tell the doctor if the previous shot caused any side effects. ", "You should not receive a booster vaccine if you had a life-threatening allergic reaction after the first shot.", "Becoming infected with hepatitis is much more dangerous to your health than receiving this vaccine. However, like any medicine, this vaccine can cause side effects but the risk of serious side effects is extremely low.", "You may feel faint after receiving this vaccine.  Some people have had seizure like reactions after receiving this vaccine.  Your doctor may want you to remain under observation during the first 15 minutes after the injection.", "Call your doctor at once if you have:", "numbness, tingling, or burning pain;", "red or blistering skin rash with burning or tingly feeling; ", "easy bruising or bleeding (nosebleeds, bleeding gums); or", "unexplained muscle pain, tenderness, or weakness."]}, "Generic Name": "hepatitis A and hepatitis B vaccine", "Related drugs": {"hepatitis a prophylaxis": ["Havrix", "hepatitis a adult vaccine", "Twinrix", "hepatitis a adult vaccine / hepatitis b adult vaccine", "hepatitis a pediatric vaccine", "Havrix Pediatric", "Vaqta Pediatric", "Vaqta"], "hepatitis b prophylaxis": ["Engerix-B", "hepatitis b adult vaccine", "Twinrix", "hepatitis a adult vaccine / hepatitis b adult vaccine", "Recombivax HB Adult", "Recombivax HB Dialysis Formulation", "Pediarix", "Engerix-B Pediatric", "hepatitis b pediatric vaccine", "Recombivax HB Pediatric / Adolescent", "diphtheria toxoid / hepatitis b pediatric vaccine / pertussis, acellular / poliovirus vaccine, inactivated / tetanus toxoid"]}, "Interactions": {}, "Drug Name": "Twinrix Preservative-Free"}